LAYERS =  1
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 256, 256]           1,728
       BatchNorm2d-2         [-1, 64, 256, 256]             128
         LeakyReLU-3         [-1, 64, 256, 256]               0
            Conv2d-4         [-1, 64, 256, 256]          36,864
       BatchNorm2d-5         [-1, 64, 256, 256]             128
         LeakyReLU-6         [-1, 64, 256, 256]               0
        DoubleConv-7         [-1, 64, 256, 256]               0
         MaxPool2d-8         [-1, 64, 128, 128]               0
            Conv2d-9        [-1, 128, 128, 128]          73,728
      BatchNorm2d-10        [-1, 128, 128, 128]             256
        LeakyReLU-11        [-1, 128, 128, 128]               0
           Conv2d-12        [-1, 128, 128, 128]         147,456
      BatchNorm2d-13        [-1, 128, 128, 128]             256
        LeakyReLU-14        [-1, 128, 128, 128]               0
       DoubleConv-15        [-1, 128, 128, 128]               0
  ConvTranspose2d-16         [-1, 64, 256, 256]          32,832
           Conv2d-17         [-1, 64, 256, 256]          73,728
      BatchNorm2d-18         [-1, 64, 256, 256]             128
        LeakyReLU-19         [-1, 64, 256, 256]               0
           Conv2d-20         [-1, 64, 256, 256]          36,864
      BatchNorm2d-21         [-1, 64, 256, 256]             128
        LeakyReLU-22         [-1, 64, 256, 256]               0
       DoubleConv-23         [-1, 64, 256, 256]               0
           Conv2d-24          [-1, 1, 256, 256]              65
================================================================
Total params: 404,289
Trainable params: 404,289
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 600.50
Params size (MB): 1.54
Estimated Total Size (MB): 602.79
----------------------------------------------------------------


LAYERS =  2
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 256, 256]           1,728
       BatchNorm2d-2         [-1, 64, 256, 256]             128
         LeakyReLU-3         [-1, 64, 256, 256]               0
            Conv2d-4         [-1, 64, 256, 256]          36,864
       BatchNorm2d-5         [-1, 64, 256, 256]             128
         LeakyReLU-6         [-1, 64, 256, 256]               0
        DoubleConv-7         [-1, 64, 256, 256]               0
         MaxPool2d-8         [-1, 64, 128, 128]               0
            Conv2d-9        [-1, 128, 128, 128]          73,728
      BatchNorm2d-10        [-1, 128, 128, 128]             256
        LeakyReLU-11        [-1, 128, 128, 128]               0
           Conv2d-12        [-1, 128, 128, 128]         147,456
      BatchNorm2d-13        [-1, 128, 128, 128]             256
        LeakyReLU-14        [-1, 128, 128, 128]               0
       DoubleConv-15        [-1, 128, 128, 128]               0
        MaxPool2d-16          [-1, 128, 64, 64]               0
           Conv2d-17          [-1, 256, 64, 64]         294,912
      BatchNorm2d-18          [-1, 256, 64, 64]             512
        LeakyReLU-19          [-1, 256, 64, 64]               0
           Conv2d-20          [-1, 256, 64, 64]         589,824
      BatchNorm2d-21          [-1, 256, 64, 64]             512
        LeakyReLU-22          [-1, 256, 64, 64]               0
       DoubleConv-23          [-1, 256, 64, 64]               0
  ConvTranspose2d-24        [-1, 128, 128, 128]         131,200
           Conv2d-25        [-1, 128, 128, 128]         294,912
      BatchNorm2d-26        [-1, 128, 128, 128]             256
        LeakyReLU-27        [-1, 128, 128, 128]               0
           Conv2d-28        [-1, 128, 128, 128]         147,456
      BatchNorm2d-29        [-1, 128, 128, 128]             256
        LeakyReLU-30        [-1, 128, 128, 128]               0
       DoubleConv-31        [-1, 128, 128, 128]               0
  ConvTranspose2d-32         [-1, 64, 256, 256]          32,832
           Conv2d-33         [-1, 64, 256, 256]          73,728
      BatchNorm2d-34         [-1, 64, 256, 256]             128
        LeakyReLU-35         [-1, 64, 256, 256]               0
           Conv2d-36         [-1, 64, 256, 256]          36,864
      BatchNorm2d-37         [-1, 64, 256, 256]             128
        LeakyReLU-38         [-1, 64, 256, 256]               0
       DoubleConv-39         [-1, 64, 256, 256]               0
           Conv2d-40          [-1, 1, 256, 256]              65
================================================================
Total params: 1,864,129
Trainable params: 1,864,129
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 788.50
Params size (MB): 7.11
Estimated Total Size (MB): 796.36
----------------------------------------------------------------


LAYERS =  3
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 256, 256]           1,728
       BatchNorm2d-2         [-1, 64, 256, 256]             128
         LeakyReLU-3         [-1, 64, 256, 256]               0
            Conv2d-4         [-1, 64, 256, 256]          36,864
       BatchNorm2d-5         [-1, 64, 256, 256]             128
         LeakyReLU-6         [-1, 64, 256, 256]               0
        DoubleConv-7         [-1, 64, 256, 256]               0
         MaxPool2d-8         [-1, 64, 128, 128]               0
            Conv2d-9        [-1, 128, 128, 128]          73,728
      BatchNorm2d-10        [-1, 128, 128, 128]             256
        LeakyReLU-11        [-1, 128, 128, 128]               0
           Conv2d-12        [-1, 128, 128, 128]         147,456
      BatchNorm2d-13        [-1, 128, 128, 128]             256
        LeakyReLU-14        [-1, 128, 128, 128]               0
       DoubleConv-15        [-1, 128, 128, 128]               0
        MaxPool2d-16          [-1, 128, 64, 64]               0
           Conv2d-17          [-1, 256, 64, 64]         294,912
      BatchNorm2d-18          [-1, 256, 64, 64]             512
        LeakyReLU-19          [-1, 256, 64, 64]               0
           Conv2d-20          [-1, 256, 64, 64]         589,824
      BatchNorm2d-21          [-1, 256, 64, 64]             512
        LeakyReLU-22          [-1, 256, 64, 64]               0
       DoubleConv-23          [-1, 256, 64, 64]               0
        MaxPool2d-24          [-1, 256, 32, 32]               0
           Conv2d-25          [-1, 512, 32, 32]       1,179,648
      BatchNorm2d-26          [-1, 512, 32, 32]           1,024
        LeakyReLU-27          [-1, 512, 32, 32]               0
           Conv2d-28          [-1, 512, 32, 32]       2,359,296
      BatchNorm2d-29          [-1, 512, 32, 32]           1,024
        LeakyReLU-30          [-1, 512, 32, 32]               0
       DoubleConv-31          [-1, 512, 32, 32]               0
  ConvTranspose2d-32          [-1, 256, 64, 64]         524,544
           Conv2d-33          [-1, 256, 64, 64]       1,179,648
      BatchNorm2d-34          [-1, 256, 64, 64]             512
        LeakyReLU-35          [-1, 256, 64, 64]               0
           Conv2d-36          [-1, 256, 64, 64]         589,824
      BatchNorm2d-37          [-1, 256, 64, 64]             512
        LeakyReLU-38          [-1, 256, 64, 64]               0
       DoubleConv-39          [-1, 256, 64, 64]               0
  ConvTranspose2d-40        [-1, 128, 128, 128]         131,200
           Conv2d-41        [-1, 128, 128, 128]         294,912
      BatchNorm2d-42        [-1, 128, 128, 128]             256
        LeakyReLU-43        [-1, 128, 128, 128]               0
           Conv2d-44        [-1, 128, 128, 128]         147,456
      BatchNorm2d-45        [-1, 128, 128, 128]             256
        LeakyReLU-46        [-1, 128, 128, 128]               0
       DoubleConv-47        [-1, 128, 128, 128]               0
  ConvTranspose2d-48         [-1, 64, 256, 256]          32,832
           Conv2d-49         [-1, 64, 256, 256]          73,728
      BatchNorm2d-50         [-1, 64, 256, 256]             128
        LeakyReLU-51         [-1, 64, 256, 256]               0
           Conv2d-52         [-1, 64, 256, 256]          36,864
      BatchNorm2d-53         [-1, 64, 256, 256]             128
        LeakyReLU-54         [-1, 64, 256, 256]               0
       DoubleConv-55         [-1, 64, 256, 256]               0
           Conv2d-56          [-1, 1, 256, 256]              65
================================================================
Total params: 7,700,161
Trainable params: 7,700,161
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 882.50
Params size (MB): 29.37
Estimated Total Size (MB): 912.62
----------------------------------------------------------------


LAYERS =  4
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 256, 256]           1,728
       BatchNorm2d-2         [-1, 64, 256, 256]             128
         LeakyReLU-3         [-1, 64, 256, 256]               0
            Conv2d-4         [-1, 64, 256, 256]          36,864
       BatchNorm2d-5         [-1, 64, 256, 256]             128
         LeakyReLU-6         [-1, 64, 256, 256]               0
        DoubleConv-7         [-1, 64, 256, 256]               0
         MaxPool2d-8         [-1, 64, 128, 128]               0
            Conv2d-9        [-1, 128, 128, 128]          73,728
      BatchNorm2d-10        [-1, 128, 128, 128]             256
        LeakyReLU-11        [-1, 128, 128, 128]               0
           Conv2d-12        [-1, 128, 128, 128]         147,456
      BatchNorm2d-13        [-1, 128, 128, 128]             256
        LeakyReLU-14        [-1, 128, 128, 128]               0
       DoubleConv-15        [-1, 128, 128, 128]               0
        MaxPool2d-16          [-1, 128, 64, 64]               0
           Conv2d-17          [-1, 256, 64, 64]         294,912
      BatchNorm2d-18          [-1, 256, 64, 64]             512
        LeakyReLU-19          [-1, 256, 64, 64]               0
           Conv2d-20          [-1, 256, 64, 64]         589,824
      BatchNorm2d-21          [-1, 256, 64, 64]             512
        LeakyReLU-22          [-1, 256, 64, 64]               0
       DoubleConv-23          [-1, 256, 64, 64]               0
        MaxPool2d-24          [-1, 256, 32, 32]               0
           Conv2d-25          [-1, 512, 32, 32]       1,179,648
      BatchNorm2d-26          [-1, 512, 32, 32]           1,024
        LeakyReLU-27          [-1, 512, 32, 32]               0
           Conv2d-28          [-1, 512, 32, 32]       2,359,296
      BatchNorm2d-29          [-1, 512, 32, 32]           1,024
        LeakyReLU-30          [-1, 512, 32, 32]               0
       DoubleConv-31          [-1, 512, 32, 32]               0
        MaxPool2d-32          [-1, 512, 16, 16]               0
           Conv2d-33         [-1, 1024, 16, 16]       4,718,592
      BatchNorm2d-34         [-1, 1024, 16, 16]           2,048
        LeakyReLU-35         [-1, 1024, 16, 16]               0
           Conv2d-36         [-1, 1024, 16, 16]       9,437,184
      BatchNorm2d-37         [-1, 1024, 16, 16]           2,048
        LeakyReLU-38         [-1, 1024, 16, 16]               0
       DoubleConv-39         [-1, 1024, 16, 16]               0
  ConvTranspose2d-40          [-1, 512, 32, 32]       2,097,664
           Conv2d-41          [-1, 512, 32, 32]       4,718,592
      BatchNorm2d-42          [-1, 512, 32, 32]           1,024
        LeakyReLU-43          [-1, 512, 32, 32]               0
           Conv2d-44          [-1, 512, 32, 32]       2,359,296
      BatchNorm2d-45          [-1, 512, 32, 32]           1,024
        LeakyReLU-46          [-1, 512, 32, 32]               0
       DoubleConv-47          [-1, 512, 32, 32]               0
  ConvTranspose2d-48          [-1, 256, 64, 64]         524,544
           Conv2d-49          [-1, 256, 64, 64]       1,179,648
      BatchNorm2d-50          [-1, 256, 64, 64]             512
        LeakyReLU-51          [-1, 256, 64, 64]               0
           Conv2d-52          [-1, 256, 64, 64]         589,824
      BatchNorm2d-53          [-1, 256, 64, 64]             512
        LeakyReLU-54          [-1, 256, 64, 64]               0
       DoubleConv-55          [-1, 256, 64, 64]               0
  ConvTranspose2d-56        [-1, 128, 128, 128]         131,200
           Conv2d-57        [-1, 128, 128, 128]         294,912
      BatchNorm2d-58        [-1, 128, 128, 128]             256
        LeakyReLU-59        [-1, 128, 128, 128]               0
           Conv2d-60        [-1, 128, 128, 128]         147,456
      BatchNorm2d-61        [-1, 128, 128, 128]             256
        LeakyReLU-62        [-1, 128, 128, 128]               0
       DoubleConv-63        [-1, 128, 128, 128]               0
  ConvTranspose2d-64         [-1, 64, 256, 256]          32,832
           Conv2d-65         [-1, 64, 256, 256]          73,728
      BatchNorm2d-66         [-1, 64, 256, 256]             128
        LeakyReLU-67         [-1, 64, 256, 256]               0
           Conv2d-68         [-1, 64, 256, 256]          36,864
      BatchNorm2d-69         [-1, 64, 256, 256]             128
        LeakyReLU-70         [-1, 64, 256, 256]               0
       DoubleConv-71         [-1, 64, 256, 256]               0
           Conv2d-72          [-1, 1, 256, 256]              65
================================================================
Total params: 31,037,633
Trainable params: 31,037,633
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 929.50
Params size (MB): 118.40
Estimated Total Size (MB): 1048.65
----------------------------------------------------------------


LAYERS =  5
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 256, 256]           1,728
       BatchNorm2d-2         [-1, 64, 256, 256]             128
         LeakyReLU-3         [-1, 64, 256, 256]               0
            Conv2d-4         [-1, 64, 256, 256]          36,864
       BatchNorm2d-5         [-1, 64, 256, 256]             128
         LeakyReLU-6         [-1, 64, 256, 256]               0
        DoubleConv-7         [-1, 64, 256, 256]               0
         MaxPool2d-8         [-1, 64, 128, 128]               0
            Conv2d-9        [-1, 128, 128, 128]          73,728
      BatchNorm2d-10        [-1, 128, 128, 128]             256
        LeakyReLU-11        [-1, 128, 128, 128]               0
           Conv2d-12        [-1, 128, 128, 128]         147,456
      BatchNorm2d-13        [-1, 128, 128, 128]             256
        LeakyReLU-14        [-1, 128, 128, 128]               0
       DoubleConv-15        [-1, 128, 128, 128]               0
        MaxPool2d-16          [-1, 128, 64, 64]               0
           Conv2d-17          [-1, 256, 64, 64]         294,912
      BatchNorm2d-18          [-1, 256, 64, 64]             512
        LeakyReLU-19          [-1, 256, 64, 64]               0
           Conv2d-20          [-1, 256, 64, 64]         589,824
      BatchNorm2d-21          [-1, 256, 64, 64]             512
        LeakyReLU-22          [-1, 256, 64, 64]               0
       DoubleConv-23          [-1, 256, 64, 64]               0
        MaxPool2d-24          [-1, 256, 32, 32]               0
           Conv2d-25          [-1, 512, 32, 32]       1,179,648
      BatchNorm2d-26          [-1, 512, 32, 32]           1,024
        LeakyReLU-27          [-1, 512, 32, 32]               0
           Conv2d-28          [-1, 512, 32, 32]       2,359,296
      BatchNorm2d-29          [-1, 512, 32, 32]           1,024
        LeakyReLU-30          [-1, 512, 32, 32]               0
       DoubleConv-31          [-1, 512, 32, 32]               0
        MaxPool2d-32          [-1, 512, 16, 16]               0
           Conv2d-33         [-1, 1024, 16, 16]       4,718,592
      BatchNorm2d-34         [-1, 1024, 16, 16]           2,048
        LeakyReLU-35         [-1, 1024, 16, 16]               0
           Conv2d-36         [-1, 1024, 16, 16]       9,437,184
      BatchNorm2d-37         [-1, 1024, 16, 16]           2,048
        LeakyReLU-38         [-1, 1024, 16, 16]               0
       DoubleConv-39         [-1, 1024, 16, 16]               0
        MaxPool2d-40           [-1, 1024, 8, 8]               0
           Conv2d-41           [-1, 2048, 8, 8]      18,874,368
      BatchNorm2d-42           [-1, 2048, 8, 8]           4,096
        LeakyReLU-43           [-1, 2048, 8, 8]               0
           Conv2d-44           [-1, 2048, 8, 8]      37,748,736
      BatchNorm2d-45           [-1, 2048, 8, 8]           4,096
        LeakyReLU-46           [-1, 2048, 8, 8]               0
       DoubleConv-47           [-1, 2048, 8, 8]               0
  ConvTranspose2d-48         [-1, 1024, 16, 16]       8,389,632
           Conv2d-49         [-1, 1024, 16, 16]      18,874,368
      BatchNorm2d-50         [-1, 1024, 16, 16]           2,048
        LeakyReLU-51         [-1, 1024, 16, 16]               0
           Conv2d-52         [-1, 1024, 16, 16]       9,437,184
      BatchNorm2d-53         [-1, 1024, 16, 16]           2,048
        LeakyReLU-54         [-1, 1024, 16, 16]               0
       DoubleConv-55         [-1, 1024, 16, 16]               0
  ConvTranspose2d-56          [-1, 512, 32, 32]       2,097,664
           Conv2d-57          [-1, 512, 32, 32]       4,718,592
      BatchNorm2d-58          [-1, 512, 32, 32]           1,024
        LeakyReLU-59          [-1, 512, 32, 32]               0
           Conv2d-60          [-1, 512, 32, 32]       2,359,296
      BatchNorm2d-61          [-1, 512, 32, 32]           1,024
        LeakyReLU-62          [-1, 512, 32, 32]               0
       DoubleConv-63          [-1, 512, 32, 32]               0
  ConvTranspose2d-64          [-1, 256, 64, 64]         524,544
           Conv2d-65          [-1, 256, 64, 64]       1,179,648
      BatchNorm2d-66          [-1, 256, 64, 64]             512
        LeakyReLU-67          [-1, 256, 64, 64]               0
           Conv2d-68          [-1, 256, 64, 64]         589,824
      BatchNorm2d-69          [-1, 256, 64, 64]             512
        LeakyReLU-70          [-1, 256, 64, 64]               0
       DoubleConv-71          [-1, 256, 64, 64]               0
  ConvTranspose2d-72        [-1, 128, 128, 128]         131,200
           Conv2d-73        [-1, 128, 128, 128]         294,912
      BatchNorm2d-74        [-1, 128, 128, 128]             256
        LeakyReLU-75        [-1, 128, 128, 128]               0
           Conv2d-76        [-1, 128, 128, 128]         147,456
      BatchNorm2d-77        [-1, 128, 128, 128]             256
        LeakyReLU-78        [-1, 128, 128, 128]               0
       DoubleConv-79        [-1, 128, 128, 128]               0
  ConvTranspose2d-80         [-1, 64, 256, 256]          32,832
           Conv2d-81         [-1, 64, 256, 256]          73,728
      BatchNorm2d-82         [-1, 64, 256, 256]             128
        LeakyReLU-83         [-1, 64, 256, 256]               0
           Conv2d-84         [-1, 64, 256, 256]          36,864
      BatchNorm2d-85         [-1, 64, 256, 256]             128
        LeakyReLU-86         [-1, 64, 256, 256]               0
       DoubleConv-87         [-1, 64, 256, 256]               0
           Conv2d-88          [-1, 1, 256, 256]              65
================================================================
Total params: 124,374,209
Trainable params: 124,374,209
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 953.00
Params size (MB): 474.45
Estimated Total Size (MB): 1428.20
----------------------------------------------------------------


