channels =  64
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 256, 256]           1,728
       BatchNorm2d-2         [-1, 64, 256, 256]             128
         LeakyReLU-3         [-1, 64, 256, 256]               0
            Conv2d-4         [-1, 64, 256, 256]          36,864
       BatchNorm2d-5         [-1, 64, 256, 256]             128
         LeakyReLU-6         [-1, 64, 256, 256]               0
        DoubleConv-7         [-1, 64, 256, 256]               0
         MaxPool2d-8         [-1, 64, 128, 128]               0
            Conv2d-9        [-1, 128, 128, 128]          73,728
      BatchNorm2d-10        [-1, 128, 128, 128]             256
        LeakyReLU-11        [-1, 128, 128, 128]               0
           Conv2d-12        [-1, 128, 128, 128]         147,456
      BatchNorm2d-13        [-1, 128, 128, 128]             256
        LeakyReLU-14        [-1, 128, 128, 128]               0
       DoubleConv-15        [-1, 128, 128, 128]               0
        MaxPool2d-16          [-1, 128, 64, 64]               0
           Conv2d-17          [-1, 256, 64, 64]         294,912
      BatchNorm2d-18          [-1, 256, 64, 64]             512
        LeakyReLU-19          [-1, 256, 64, 64]               0
           Conv2d-20          [-1, 256, 64, 64]         589,824
      BatchNorm2d-21          [-1, 256, 64, 64]             512
        LeakyReLU-22          [-1, 256, 64, 64]               0
       DoubleConv-23          [-1, 256, 64, 64]               0
        MaxPool2d-24          [-1, 256, 32, 32]               0
           Conv2d-25          [-1, 512, 32, 32]       1,179,648
      BatchNorm2d-26          [-1, 512, 32, 32]           1,024
        LeakyReLU-27          [-1, 512, 32, 32]               0
           Conv2d-28          [-1, 512, 32, 32]       2,359,296
      BatchNorm2d-29          [-1, 512, 32, 32]           1,024
        LeakyReLU-30          [-1, 512, 32, 32]               0
       DoubleConv-31          [-1, 512, 32, 32]               0
        MaxPool2d-32          [-1, 512, 16, 16]               0
           Conv2d-33         [-1, 1024, 16, 16]       4,718,592
      BatchNorm2d-34         [-1, 1024, 16, 16]           2,048
        LeakyReLU-35         [-1, 1024, 16, 16]               0
           Conv2d-36         [-1, 1024, 16, 16]       9,437,184
      BatchNorm2d-37         [-1, 1024, 16, 16]           2,048
        LeakyReLU-38         [-1, 1024, 16, 16]               0
       DoubleConv-39         [-1, 1024, 16, 16]               0
  ConvTranspose2d-40          [-1, 512, 32, 32]       2,097,664
           Conv2d-41          [-1, 512, 32, 32]       4,718,592
      BatchNorm2d-42          [-1, 512, 32, 32]           1,024
        LeakyReLU-43          [-1, 512, 32, 32]               0
           Conv2d-44          [-1, 512, 32, 32]       2,359,296
      BatchNorm2d-45          [-1, 512, 32, 32]           1,024
        LeakyReLU-46          [-1, 512, 32, 32]               0
       DoubleConv-47          [-1, 512, 32, 32]               0
  ConvTranspose2d-48          [-1, 256, 64, 64]         524,544
           Conv2d-49          [-1, 256, 64, 64]       1,179,648
      BatchNorm2d-50          [-1, 256, 64, 64]             512
        LeakyReLU-51          [-1, 256, 64, 64]               0
           Conv2d-52          [-1, 256, 64, 64]         589,824
      BatchNorm2d-53          [-1, 256, 64, 64]             512
        LeakyReLU-54          [-1, 256, 64, 64]               0
       DoubleConv-55          [-1, 256, 64, 64]               0
  ConvTranspose2d-56        [-1, 128, 128, 128]         131,200
           Conv2d-57        [-1, 128, 128, 128]         294,912
      BatchNorm2d-58        [-1, 128, 128, 128]             256
        LeakyReLU-59        [-1, 128, 128, 128]               0
           Conv2d-60        [-1, 128, 128, 128]         147,456
      BatchNorm2d-61        [-1, 128, 128, 128]             256
        LeakyReLU-62        [-1, 128, 128, 128]               0
       DoubleConv-63        [-1, 128, 128, 128]               0
  ConvTranspose2d-64         [-1, 64, 256, 256]          32,832
           Conv2d-65         [-1, 64, 256, 256]          73,728
      BatchNorm2d-66         [-1, 64, 256, 256]             128
        LeakyReLU-67         [-1, 64, 256, 256]               0
           Conv2d-68         [-1, 64, 256, 256]          36,864
      BatchNorm2d-69         [-1, 64, 256, 256]             128
        LeakyReLU-70         [-1, 64, 256, 256]               0
       DoubleConv-71         [-1, 64, 256, 256]               0
           Conv2d-72          [-1, 1, 256, 256]              65
================================================================
Total params: 31,037,633
Trainable params: 31,037,633
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 929.50
Params size (MB): 118.40
Estimated Total Size (MB): 1048.65
----------------------------------------------------------------


channels =  32
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 256, 256]             864
       BatchNorm2d-2         [-1, 32, 256, 256]              64
         LeakyReLU-3         [-1, 32, 256, 256]               0
            Conv2d-4         [-1, 32, 256, 256]           9,216
       BatchNorm2d-5         [-1, 32, 256, 256]              64
         LeakyReLU-6         [-1, 32, 256, 256]               0
        DoubleConv-7         [-1, 32, 256, 256]               0
         MaxPool2d-8         [-1, 32, 128, 128]               0
            Conv2d-9         [-1, 64, 128, 128]          18,432
      BatchNorm2d-10         [-1, 64, 128, 128]             128
        LeakyReLU-11         [-1, 64, 128, 128]               0
           Conv2d-12         [-1, 64, 128, 128]          36,864
      BatchNorm2d-13         [-1, 64, 128, 128]             128
        LeakyReLU-14         [-1, 64, 128, 128]               0
       DoubleConv-15         [-1, 64, 128, 128]               0
        MaxPool2d-16           [-1, 64, 64, 64]               0
           Conv2d-17          [-1, 128, 64, 64]          73,728
      BatchNorm2d-18          [-1, 128, 64, 64]             256
        LeakyReLU-19          [-1, 128, 64, 64]               0
           Conv2d-20          [-1, 128, 64, 64]         147,456
      BatchNorm2d-21          [-1, 128, 64, 64]             256
        LeakyReLU-22          [-1, 128, 64, 64]               0
       DoubleConv-23          [-1, 128, 64, 64]               0
        MaxPool2d-24          [-1, 128, 32, 32]               0
           Conv2d-25          [-1, 256, 32, 32]         294,912
      BatchNorm2d-26          [-1, 256, 32, 32]             512
        LeakyReLU-27          [-1, 256, 32, 32]               0
           Conv2d-28          [-1, 256, 32, 32]         589,824
      BatchNorm2d-29          [-1, 256, 32, 32]             512
        LeakyReLU-30          [-1, 256, 32, 32]               0
       DoubleConv-31          [-1, 256, 32, 32]               0
        MaxPool2d-32          [-1, 256, 16, 16]               0
           Conv2d-33          [-1, 512, 16, 16]       1,179,648
      BatchNorm2d-34          [-1, 512, 16, 16]           1,024
        LeakyReLU-35          [-1, 512, 16, 16]               0
           Conv2d-36          [-1, 512, 16, 16]       2,359,296
      BatchNorm2d-37          [-1, 512, 16, 16]           1,024
        LeakyReLU-38          [-1, 512, 16, 16]               0
       DoubleConv-39          [-1, 512, 16, 16]               0
  ConvTranspose2d-40          [-1, 256, 32, 32]         524,544
           Conv2d-41          [-1, 256, 32, 32]       1,179,648
      BatchNorm2d-42          [-1, 256, 32, 32]             512
        LeakyReLU-43          [-1, 256, 32, 32]               0
           Conv2d-44          [-1, 256, 32, 32]         589,824
      BatchNorm2d-45          [-1, 256, 32, 32]             512
        LeakyReLU-46          [-1, 256, 32, 32]               0
       DoubleConv-47          [-1, 256, 32, 32]               0
  ConvTranspose2d-48          [-1, 128, 64, 64]         131,200
           Conv2d-49          [-1, 128, 64, 64]         294,912
      BatchNorm2d-50          [-1, 128, 64, 64]             256
        LeakyReLU-51          [-1, 128, 64, 64]               0
           Conv2d-52          [-1, 128, 64, 64]         147,456
      BatchNorm2d-53          [-1, 128, 64, 64]             256
        LeakyReLU-54          [-1, 128, 64, 64]               0
       DoubleConv-55          [-1, 128, 64, 64]               0
  ConvTranspose2d-56         [-1, 64, 128, 128]          32,832
           Conv2d-57         [-1, 64, 128, 128]          73,728
      BatchNorm2d-58         [-1, 64, 128, 128]             128
        LeakyReLU-59         [-1, 64, 128, 128]               0
           Conv2d-60         [-1, 64, 128, 128]          36,864
      BatchNorm2d-61         [-1, 64, 128, 128]             128
        LeakyReLU-62         [-1, 64, 128, 128]               0
       DoubleConv-63         [-1, 64, 128, 128]               0
  ConvTranspose2d-64         [-1, 32, 256, 256]           8,224
           Conv2d-65         [-1, 32, 256, 256]          18,432
      BatchNorm2d-66         [-1, 32, 256, 256]              64
        LeakyReLU-67         [-1, 32, 256, 256]               0
           Conv2d-68         [-1, 32, 256, 256]           9,216
      BatchNorm2d-69         [-1, 32, 256, 256]              64
        LeakyReLU-70         [-1, 32, 256, 256]               0
       DoubleConv-71         [-1, 32, 256, 256]               0
           Conv2d-72          [-1, 1, 256, 256]              33
================================================================
Total params: 7,763,041
Trainable params: 7,763,041
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 465.00
Params size (MB): 29.61
Estimated Total Size (MB): 495.36
----------------------------------------------------------------


channels =  16
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 256, 256]             432
       BatchNorm2d-2         [-1, 16, 256, 256]              32
         LeakyReLU-3         [-1, 16, 256, 256]               0
            Conv2d-4         [-1, 16, 256, 256]           2,304
       BatchNorm2d-5         [-1, 16, 256, 256]              32
         LeakyReLU-6         [-1, 16, 256, 256]               0
        DoubleConv-7         [-1, 16, 256, 256]               0
         MaxPool2d-8         [-1, 16, 128, 128]               0
            Conv2d-9         [-1, 32, 128, 128]           4,608
      BatchNorm2d-10         [-1, 32, 128, 128]              64
        LeakyReLU-11         [-1, 32, 128, 128]               0
           Conv2d-12         [-1, 32, 128, 128]           9,216
      BatchNorm2d-13         [-1, 32, 128, 128]              64
        LeakyReLU-14         [-1, 32, 128, 128]               0
       DoubleConv-15         [-1, 32, 128, 128]               0
        MaxPool2d-16           [-1, 32, 64, 64]               0
           Conv2d-17           [-1, 64, 64, 64]          18,432
      BatchNorm2d-18           [-1, 64, 64, 64]             128
        LeakyReLU-19           [-1, 64, 64, 64]               0
           Conv2d-20           [-1, 64, 64, 64]          36,864
      BatchNorm2d-21           [-1, 64, 64, 64]             128
        LeakyReLU-22           [-1, 64, 64, 64]               0
       DoubleConv-23           [-1, 64, 64, 64]               0
        MaxPool2d-24           [-1, 64, 32, 32]               0
           Conv2d-25          [-1, 128, 32, 32]          73,728
      BatchNorm2d-26          [-1, 128, 32, 32]             256
        LeakyReLU-27          [-1, 128, 32, 32]               0
           Conv2d-28          [-1, 128, 32, 32]         147,456
      BatchNorm2d-29          [-1, 128, 32, 32]             256
        LeakyReLU-30          [-1, 128, 32, 32]               0
       DoubleConv-31          [-1, 128, 32, 32]               0
        MaxPool2d-32          [-1, 128, 16, 16]               0
           Conv2d-33          [-1, 256, 16, 16]         294,912
      BatchNorm2d-34          [-1, 256, 16, 16]             512
        LeakyReLU-35          [-1, 256, 16, 16]               0
           Conv2d-36          [-1, 256, 16, 16]         589,824
      BatchNorm2d-37          [-1, 256, 16, 16]             512
        LeakyReLU-38          [-1, 256, 16, 16]               0
       DoubleConv-39          [-1, 256, 16, 16]               0
  ConvTranspose2d-40          [-1, 128, 32, 32]         131,200
           Conv2d-41          [-1, 128, 32, 32]         294,912
      BatchNorm2d-42          [-1, 128, 32, 32]             256
        LeakyReLU-43          [-1, 128, 32, 32]               0
           Conv2d-44          [-1, 128, 32, 32]         147,456
      BatchNorm2d-45          [-1, 128, 32, 32]             256
        LeakyReLU-46          [-1, 128, 32, 32]               0
       DoubleConv-47          [-1, 128, 32, 32]               0
  ConvTranspose2d-48           [-1, 64, 64, 64]          32,832
           Conv2d-49           [-1, 64, 64, 64]          73,728
      BatchNorm2d-50           [-1, 64, 64, 64]             128
        LeakyReLU-51           [-1, 64, 64, 64]               0
           Conv2d-52           [-1, 64, 64, 64]          36,864
      BatchNorm2d-53           [-1, 64, 64, 64]             128
        LeakyReLU-54           [-1, 64, 64, 64]               0
       DoubleConv-55           [-1, 64, 64, 64]               0
  ConvTranspose2d-56         [-1, 32, 128, 128]           8,224
           Conv2d-57         [-1, 32, 128, 128]          18,432
      BatchNorm2d-58         [-1, 32, 128, 128]              64
        LeakyReLU-59         [-1, 32, 128, 128]               0
           Conv2d-60         [-1, 32, 128, 128]           9,216
      BatchNorm2d-61         [-1, 32, 128, 128]              64
        LeakyReLU-62         [-1, 32, 128, 128]               0
       DoubleConv-63         [-1, 32, 128, 128]               0
  ConvTranspose2d-64         [-1, 16, 256, 256]           2,064
           Conv2d-65         [-1, 16, 256, 256]           4,608
      BatchNorm2d-66         [-1, 16, 256, 256]              32
        LeakyReLU-67         [-1, 16, 256, 256]               0
           Conv2d-68         [-1, 16, 256, 256]           2,304
      BatchNorm2d-69         [-1, 16, 256, 256]              32
        LeakyReLU-70         [-1, 16, 256, 256]               0
       DoubleConv-71         [-1, 16, 256, 256]               0
           Conv2d-72          [-1, 1, 256, 256]              17
================================================================
Total params: 1,942,577
Trainable params: 1,942,577
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 232.75
Params size (MB): 7.41
Estimated Total Size (MB): 240.91
----------------------------------------------------------------


channels =  8
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 8, 256, 256]             216
       BatchNorm2d-2          [-1, 8, 256, 256]              16
         LeakyReLU-3          [-1, 8, 256, 256]               0
            Conv2d-4          [-1, 8, 256, 256]             576
       BatchNorm2d-5          [-1, 8, 256, 256]              16
         LeakyReLU-6          [-1, 8, 256, 256]               0
        DoubleConv-7          [-1, 8, 256, 256]               0
         MaxPool2d-8          [-1, 8, 128, 128]               0
            Conv2d-9         [-1, 16, 128, 128]           1,152
      BatchNorm2d-10         [-1, 16, 128, 128]              32
        LeakyReLU-11         [-1, 16, 128, 128]               0
           Conv2d-12         [-1, 16, 128, 128]           2,304
      BatchNorm2d-13         [-1, 16, 128, 128]              32
        LeakyReLU-14         [-1, 16, 128, 128]               0
       DoubleConv-15         [-1, 16, 128, 128]               0
        MaxPool2d-16           [-1, 16, 64, 64]               0
           Conv2d-17           [-1, 32, 64, 64]           4,608
      BatchNorm2d-18           [-1, 32, 64, 64]              64
        LeakyReLU-19           [-1, 32, 64, 64]               0
           Conv2d-20           [-1, 32, 64, 64]           9,216
      BatchNorm2d-21           [-1, 32, 64, 64]              64
        LeakyReLU-22           [-1, 32, 64, 64]               0
       DoubleConv-23           [-1, 32, 64, 64]               0
        MaxPool2d-24           [-1, 32, 32, 32]               0
           Conv2d-25           [-1, 64, 32, 32]          18,432
      BatchNorm2d-26           [-1, 64, 32, 32]             128
        LeakyReLU-27           [-1, 64, 32, 32]               0
           Conv2d-28           [-1, 64, 32, 32]          36,864
      BatchNorm2d-29           [-1, 64, 32, 32]             128
        LeakyReLU-30           [-1, 64, 32, 32]               0
       DoubleConv-31           [-1, 64, 32, 32]               0
        MaxPool2d-32           [-1, 64, 16, 16]               0
           Conv2d-33          [-1, 128, 16, 16]          73,728
      BatchNorm2d-34          [-1, 128, 16, 16]             256
        LeakyReLU-35          [-1, 128, 16, 16]               0
           Conv2d-36          [-1, 128, 16, 16]         147,456
      BatchNorm2d-37          [-1, 128, 16, 16]             256
        LeakyReLU-38          [-1, 128, 16, 16]               0
       DoubleConv-39          [-1, 128, 16, 16]               0
  ConvTranspose2d-40           [-1, 64, 32, 32]          32,832
           Conv2d-41           [-1, 64, 32, 32]          73,728
      BatchNorm2d-42           [-1, 64, 32, 32]             128
        LeakyReLU-43           [-1, 64, 32, 32]               0
           Conv2d-44           [-1, 64, 32, 32]          36,864
      BatchNorm2d-45           [-1, 64, 32, 32]             128
        LeakyReLU-46           [-1, 64, 32, 32]               0
       DoubleConv-47           [-1, 64, 32, 32]               0
  ConvTranspose2d-48           [-1, 32, 64, 64]           8,224
           Conv2d-49           [-1, 32, 64, 64]          18,432
      BatchNorm2d-50           [-1, 32, 64, 64]              64
        LeakyReLU-51           [-1, 32, 64, 64]               0
           Conv2d-52           [-1, 32, 64, 64]           9,216
      BatchNorm2d-53           [-1, 32, 64, 64]              64
        LeakyReLU-54           [-1, 32, 64, 64]               0
       DoubleConv-55           [-1, 32, 64, 64]               0
  ConvTranspose2d-56         [-1, 16, 128, 128]           2,064
           Conv2d-57         [-1, 16, 128, 128]           4,608
      BatchNorm2d-58         [-1, 16, 128, 128]              32
        LeakyReLU-59         [-1, 16, 128, 128]               0
           Conv2d-60         [-1, 16, 128, 128]           2,304
      BatchNorm2d-61         [-1, 16, 128, 128]              32
        LeakyReLU-62         [-1, 16, 128, 128]               0
       DoubleConv-63         [-1, 16, 128, 128]               0
  ConvTranspose2d-64          [-1, 8, 256, 256]             520
           Conv2d-65          [-1, 8, 256, 256]           1,152
      BatchNorm2d-66          [-1, 8, 256, 256]              16
        LeakyReLU-67          [-1, 8, 256, 256]               0
           Conv2d-68          [-1, 8, 256, 256]             576
      BatchNorm2d-69          [-1, 8, 256, 256]              16
        LeakyReLU-70          [-1, 8, 256, 256]               0
       DoubleConv-71          [-1, 8, 256, 256]               0
           Conv2d-72          [-1, 1, 256, 256]               9
================================================================
Total params: 486,553
Trainable params: 486,553
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 116.62
Params size (MB): 1.86
Estimated Total Size (MB): 119.23
----------------------------------------------------------------


channels =  4
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 4, 256, 256]             108
       BatchNorm2d-2          [-1, 4, 256, 256]               8
         LeakyReLU-3          [-1, 4, 256, 256]               0
            Conv2d-4          [-1, 4, 256, 256]             144
       BatchNorm2d-5          [-1, 4, 256, 256]               8
         LeakyReLU-6          [-1, 4, 256, 256]               0
        DoubleConv-7          [-1, 4, 256, 256]               0
         MaxPool2d-8          [-1, 4, 128, 128]               0
            Conv2d-9          [-1, 8, 128, 128]             288
      BatchNorm2d-10          [-1, 8, 128, 128]              16
        LeakyReLU-11          [-1, 8, 128, 128]               0
           Conv2d-12          [-1, 8, 128, 128]             576
      BatchNorm2d-13          [-1, 8, 128, 128]              16
        LeakyReLU-14          [-1, 8, 128, 128]               0
       DoubleConv-15          [-1, 8, 128, 128]               0
        MaxPool2d-16            [-1, 8, 64, 64]               0
           Conv2d-17           [-1, 16, 64, 64]           1,152
      BatchNorm2d-18           [-1, 16, 64, 64]              32
        LeakyReLU-19           [-1, 16, 64, 64]               0
           Conv2d-20           [-1, 16, 64, 64]           2,304
      BatchNorm2d-21           [-1, 16, 64, 64]              32
        LeakyReLU-22           [-1, 16, 64, 64]               0
       DoubleConv-23           [-1, 16, 64, 64]               0
        MaxPool2d-24           [-1, 16, 32, 32]               0
           Conv2d-25           [-1, 32, 32, 32]           4,608
      BatchNorm2d-26           [-1, 32, 32, 32]              64
        LeakyReLU-27           [-1, 32, 32, 32]               0
           Conv2d-28           [-1, 32, 32, 32]           9,216
      BatchNorm2d-29           [-1, 32, 32, 32]              64
        LeakyReLU-30           [-1, 32, 32, 32]               0
       DoubleConv-31           [-1, 32, 32, 32]               0
        MaxPool2d-32           [-1, 32, 16, 16]               0
           Conv2d-33           [-1, 64, 16, 16]          18,432
      BatchNorm2d-34           [-1, 64, 16, 16]             128
        LeakyReLU-35           [-1, 64, 16, 16]               0
           Conv2d-36           [-1, 64, 16, 16]          36,864
      BatchNorm2d-37           [-1, 64, 16, 16]             128
        LeakyReLU-38           [-1, 64, 16, 16]               0
       DoubleConv-39           [-1, 64, 16, 16]               0
  ConvTranspose2d-40           [-1, 32, 32, 32]           8,224
           Conv2d-41           [-1, 32, 32, 32]          18,432
      BatchNorm2d-42           [-1, 32, 32, 32]              64
        LeakyReLU-43           [-1, 32, 32, 32]               0
           Conv2d-44           [-1, 32, 32, 32]           9,216
      BatchNorm2d-45           [-1, 32, 32, 32]              64
        LeakyReLU-46           [-1, 32, 32, 32]               0
       DoubleConv-47           [-1, 32, 32, 32]               0
  ConvTranspose2d-48           [-1, 16, 64, 64]           2,064
           Conv2d-49           [-1, 16, 64, 64]           4,608
      BatchNorm2d-50           [-1, 16, 64, 64]              32
        LeakyReLU-51           [-1, 16, 64, 64]               0
           Conv2d-52           [-1, 16, 64, 64]           2,304
      BatchNorm2d-53           [-1, 16, 64, 64]              32
        LeakyReLU-54           [-1, 16, 64, 64]               0
       DoubleConv-55           [-1, 16, 64, 64]               0
  ConvTranspose2d-56          [-1, 8, 128, 128]             520
           Conv2d-57          [-1, 8, 128, 128]           1,152
      BatchNorm2d-58          [-1, 8, 128, 128]              16
        LeakyReLU-59          [-1, 8, 128, 128]               0
           Conv2d-60          [-1, 8, 128, 128]             576
      BatchNorm2d-61          [-1, 8, 128, 128]              16
        LeakyReLU-62          [-1, 8, 128, 128]               0
       DoubleConv-63          [-1, 8, 128, 128]               0
  ConvTranspose2d-64          [-1, 4, 256, 256]             132
           Conv2d-65          [-1, 4, 256, 256]             288
      BatchNorm2d-66          [-1, 4, 256, 256]               8
        LeakyReLU-67          [-1, 4, 256, 256]               0
           Conv2d-68          [-1, 4, 256, 256]             144
      BatchNorm2d-69          [-1, 4, 256, 256]               8
        LeakyReLU-70          [-1, 4, 256, 256]               0
       DoubleConv-71          [-1, 4, 256, 256]               0
           Conv2d-72          [-1, 1, 256, 256]               5
================================================================
Total params: 122,093
Trainable params: 122,093
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 58.56
Params size (MB): 0.47
Estimated Total Size (MB): 59.78
----------------------------------------------------------------


